; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v13 ?v12)
             (pred_4 ?v7 ?v11)
             (pred_8 ?v13 ?v11)
             (pred_1 ?v9 ?v13 )
	     (pred_11 ?v13)
             (pred_3 ?v3)
             (pred_7 ?v7)
             (pred_6 ?v11)
             (pred_2 ?v13)
             (pred_12 ?v7)
             (pred_5 ?v13)
             (pred_9 ))



(:action op_4
:parameters (?v1 ?v5 ?v10 ?v4)
:precondition (and (pred_3 ?v1) (pred_3 ?v5) (pred_7 ?v10) (pred_6 ?v4)
          (pred_10 ?v1 ?v5) (pred_4 ?v10 ?v4)
                   (pred_8 ?v5 ?v4) (pred_11 ?v1) 
                   (pred_2 ?v5) (pred_12 ?v10))
:effect (and  (pred_5 ?v5) (not (pred_2 ?v5))))


(:action op_1
:parameters (?v1 ?v6)
:precondition (and (pred_3 ?v1) (pred_3 ?v6)
               (pred_11 ?v1) (pred_10 ?v1 ?v6) (pred_5 ?v6))
:effect (and (pred_11 ?v6) (not (pred_11 ?v1))))

(:action op_3
:parameters (?v1 ?v10)
:precondition (and (pred_3 ?v1) (pred_7 ?v10) 
                  (pred_11 ?v1) (pred_1 ?v10 ?v1) (pred_9 ))
:effect (and (pred_12 ?v10)
   (not (pred_1 ?v10 ?v1)) (not (pred_9 ))))


(:action op_5
:parameters (?v1 ?v2 ?v8)
:precondition (and (pred_3 ?v1) (pred_7 ?v2) (pred_7 ?v8)
                  (pred_11 ?v1) (pred_12 ?v8) (pred_1 ?v2 ?v1))
:effect (and (pred_12 ?v2) (pred_1 ?v8 ?v1)
        (not (pred_12 ?v8)) (not (pred_1 ?v2 ?v1))))

(:action op_2
:parameters (?v1 ?v10)
:precondition (and (pred_3 ?v1) (pred_7 ?v10) 
                  (pred_11 ?v1) (pred_12 ?v10))
:effect (and (pred_9 ) (pred_1 ?v10 ?v1) (not (pred_12 ?v10)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_06 obj_03 obj_11 obj_09 obj_10 obj_02 obj_08 obj_04 obj_12
    obj_07 obj_01
    obj_05 obj_13
    )

    (:init
       (pred_9)

       (pred_3 obj_06)
       (pred_3 obj_03)
       (pred_3 obj_11)
       (pred_3 obj_09)
       (pred_3 obj_10)
       (pred_3 obj_02)
       (pred_3 obj_08)
       (pred_3 obj_04)
       (pred_3 obj_12)
       (pred_6 obj_07)
       (pred_6 obj_01)
       (pred_7 obj_05)
       (pred_7 obj_13)

       (pred_10 obj_06 obj_09)
       (pred_10 obj_06 obj_03)
       (pred_10 obj_03 obj_10)
       (pred_10 obj_03 obj_11)
       (pred_10 obj_03 obj_06)
       (pred_10 obj_11 obj_02)
       (pred_10 obj_11 obj_03)
       (pred_10 obj_09 obj_08)
       (pred_10 obj_09 obj_10)
       (pred_10 obj_09 obj_06)
       (pred_10 obj_10 obj_04)
       (pred_10 obj_10 obj_02)
       (pred_10 obj_10 obj_03)
       (pred_10 obj_10 obj_09)
       (pred_10 obj_02 obj_12)
       (pred_10 obj_02 obj_11)
       (pred_10 obj_02 obj_10)
       (pred_10 obj_08 obj_04)
       (pred_10 obj_08 obj_09)
       (pred_10 obj_04 obj_12)
       (pred_10 obj_04 obj_10)
       (pred_10 obj_04 obj_08)
       (pred_10 obj_12 obj_02)
       (pred_10 obj_12 obj_04)
       (pred_2 obj_02)
       (pred_2 obj_12)
       (pred_8  obj_02 obj_07)
       (pred_8  obj_12 obj_01)
       (pred_5 obj_06)
       (pred_5 obj_03)
       (pred_5 obj_11)
       (pred_5 obj_09)
       (pred_5 obj_10)
       (pred_5 obj_08)
       (pred_5 obj_04)

       (pred_4  obj_05 obj_07)
       (pred_4  obj_13 obj_01)
       (pred_1 obj_05 obj_06)
       (pred_1 obj_13 obj_06)
       (pred_11 obj_04)
    )

    (:goal (and
       (pred_1 obj_05 obj_02)
    ))
(:constraints
  (always (not (pred_11 obj_03)))
)
)

; plan
1. (op_1 obj_04 obj_10)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_10)
   goals met: 0 of 1
2. (op_1 obj_10 obj_09)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_09)
   goals met: 0 of 1
3. (op_1 obj_09 obj_06)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_06)
   goals met: 0 of 1
4. (op_3 obj_06 obj_05)
   deleted: (pred_1 obj_05 obj_06) (pred_9)
   added: (pred_12 obj_05)
   goals met: 0 of 1
5. (op_1 obj_06 obj_09)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_09)
   goals met: 0 of 1
6. (op_1 obj_09 obj_10)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_10)
   goals met: 0 of 1
7. (op_4 obj_10 obj_02 obj_05 obj_07)
   deleted: (pred_2 obj_02)
   added: (pred_5 obj_02)
   goals met: 0 of 1
8. (op_1 obj_10 obj_02)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_02)
   goals met: 0 of 1
9. (op_2 obj_02 obj_05)
   deleted: (pred_12 obj_05)
   added: (pred_9) (pred_1 obj_05 obj_02)
   goals met: 1 of 1
